# Etude du  taux de désabonnement des clients:

In [ ]:
## 1. Importation des bibliothèques et modules

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.metrics import confusion_matrix

In [3]:
#Afficher les données
df = pd.read_csv("data.csv")
df.head()

,num_ligne,ID_Client,Nom,Score_Credit,Pays,Sex,Age,Tenure,Balance,Num_Produit,il_a_CrCard,Membre_actif,Salaire_estime,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

#### Preparation du datset

In [4]:
#Suppression des colonnes num_ligne et ID_Client
df.drop('num_ligne', axis=1, inplace = True)
df.drop('ID_Client', axis=1, inplace = True)
df.head()

,Nom,Score_Credit,Pays,Sex,Age,Tenure,Balance,Num_Produit,il_a_CrCard,Membre_actif,Salaire_estime,Exited
0,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [5]:
# Suppresion de valeurs nulles 
df.isna().sum()

Nom               0
Score_Credit      0
Pays              0
Sex               0
Age               0
Tenure            0
Balance           0
Num_Produit       0
il_a_CrCard       0
Membre_actif      0
Salaire_estime    0
Exited            0
dtype: int64

In [6]:
#Affichage des variables qualitatives

df_cat = df.select_dtypes(include='object')
print(df_cat)

            Nom     Pays     Sex
0      Hargrave   France  Female
1          Hill    Spain  Female
2          Onio   France  Female
3          Boni   France  Female
4      Mitchell    Spain  Female
...         ...      ...     ...
9995   Obijiaku   France    Male
9996  Johnstone   France    Male
9997        Liu   France  Female
9998  Sabbatini  Germany    Male
9999     Walker   France  Female

[10000 rows x 3 columns]

In [7]:
#Suppression de la colone nom
df.drop('Nom', axis=1, inplace = True)
df.head()

,Score_Credit,Pays,Sex,Age,Tenure,Balance,Num_Produit,il_a_CrCard,Membre_actif,Salaire_estime,Exited
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [8]:
# Déclaration de variables muettes
df = pd.concat([df,
                     pd.get_dummies(df.Sex), 
                     pd.get_dummies(df.Pays)], axis=1)

# suppression des colonnes d'origine
df.drop('Pays', axis=1, inplace = True)
df.drop('Sex', axis=1, inplace = True)
df.head()

,Score_Credit,Age,Tenure,Balance,Num_Produit,il_a_CrCard,Membre_actif,Salaire_estime,Exited,Female,Male,France,Germany,Spain
0,619,42,2,0.00,1,1,1,101348.88,1,1,0,1,0,0
1,608,41,1,83807.86,1,0,1,112542.58,0,1,0,0,0,1
2,502,42,8,159660.80,3,1,0,113931.57,1,1,0,1,0,0
3,699,39,1,0.00,2,0,0,93826.63,0,1,0,1,0,0
4,850,43,2,125510.82,1,1,1,79084.10,0,1,0,0,0,1

In [9]:
# Définssion de X et Y

Y = df.Exited
Y=np.array((Y))

print(Y.shape)

X = df.loc[:, df.columns != 'Exited']
print(X.shape)

(10000,)
(10000, 13)

#### mise à l’échelle:

In [10]:
print(X)

      Score_Credit  Age  Tenure    Balance  Num_Produit  il_a_CrCard  \
0              619   42       2       0.00            1            1
1              608   41       1   83807.86            1            0
2              502   42       8  159660.80            3            1
3              699   39       1       0.00            2            0
4              850   43       2  125510.82            1            1
...            ...  ...     ...        ...          ...          ...
9995           771   39       5       0.00            2            1
9996           516   35      10   57369.61            1            1
9997           709   36       7       0.00            1            0
9998           772   42       3   75075.31            2            1
9999           792   28       4  130142.79            1            1

      Membre_actif  Salaire_estime  Female  Male  France  Germany  Spain
0                1       101348.88       1     0       1        0      0
1                1       112542.58       1     0       0        0      1
2                0       113931.57       1     0       1        0      0
3                0        93826.63       1     0       1        0      0
4                1        79084.10       1     0       0        0      1
...            ...             ...     ...   ...     ...      ...    ...
9995             0        96270.64       0     1       1        0      0
9996             1       101699.77       0     1       1        0      0
9997             1        42085.58       1     0       1        0      0
9998             0        92888.52       0     1       0        1      0
9999             0        38190.78       1     0       1        0      0

[10000 rows x 13 columns]

In [11]:
cols = X.columns

In [12]:

from sklearn.preprocessing import StandardScaler

sc = StandardScaler()

X = sc.fit_transform(X)

print(X)

[[-0.32622142  0.29351742 -1.04175968 ...  0.99720391 -0.57873591
  -0.57380915]
 [-0.44003595  0.19816383 -1.38753759 ... -1.00280393 -0.57873591
   1.74273971]
 [-1.53679418  0.29351742  1.03290776 ...  0.99720391 -0.57873591
  -0.57380915]
 ...
 [ 0.60498839 -0.27860412  0.68712986 ...  0.99720391 -0.57873591
  -0.57380915]
 [ 1.25683526  0.29351742 -0.69598177 ... -1.00280393  1.72790383
  -0.57380915]
 [ 1.46377078 -1.04143285 -0.35020386 ...  0.99720391 -0.57873591
  -0.57380915]]

In [13]:
X = pd.DataFrame(X, columns=[cols])
X.head()

,Score_Credit,Age,Tenure,Balance,Num_Produit,il_a_CrCard,Membre_actif,Salaire_estime,Female,Male,France,Germany,Spain
0,-0.326221,0.293517,-1.041760,-1.225848,-0.911583,0.646092,0.970243,0.021886,1.095988,-1.095988,0.997204,-0.578736,-0.573809
1,-0.440036,0.198164,-1.387538,0.117350,-0.911583,-1.547768,0.970243,0.216534,1.095988,-1.095988,-1.002804,-0.578736,1.742740
2,-1.536794,0.293517,1.032908,1.333053,2.527057,0.646092,-1.030670,0.240687,1.095988,-1.095988,0.997204,-0.578736,-0.573809
3,0.501521,0.007457,-1.387538,-1.225848,0.807737,-1.547768,-1.030670,-0.108918,1.095988,-1.095988,0.997204,-0.578736,-0.573809
4,2.063884,0.388871,-1.041760,0.785728,-0.911583,0.646092,0.970243,-0.365276,1.095988,-1.095988,-1.002804,-0.578736,1.742740

#### Entrainnement du model:

In [14]:
from sklearn.model_selection import train_test_split

# définition des bases d’apprentissages et de tests 
X_train, X_test, y_train, y_test = train_test_split(X, Y, test_size=0.1, random_state=9)

print(len(X_train), len(X_test))

9000 1000

## La régression logistique

In [15]:
from sklearn.linear_model import LogisticRegression
import time

#### Entrainement du modele

In [16]:
start = time.time()
model_logistic = LogisticRegression(max_iter=1000, random_state=9).fit(X_train, y_train)
stop = time.time()
total_time = stop - start

print(total_time)

0.04643869400024414

In [17]:
# calcul du score de précision

from sklearn.metrics import accuracy_score
y_pred_log = model_logistic.predict(X_test)

print(accuracy_score(y_test, y_pred_log))

0.806

## Le random Forest

In [18]:
from sklearn.ensemble import RandomForestClassifier

start = time.time()

# divison les données en ensembles d'entraînement et de test:
model_forest = RandomForestClassifier(n_estimators=100, random_state=9)
model_forest.fit(X_train, y_train)
stop = time.time()
total_time = stop - start

print(total_time)

1.1039447784423828

In [19]:
#taux de classification

y_pred_rforest = model_forest.predict(X_test)

print(accuracy_score(y_test, y_pred_rforest))

0.865

## Le SGD classifier

In [20]:
from sklearn.linear_model import SGDClassifier

start = time.time()
model_sgd = SGDClassifier(loss="hinge", penalty="l2", max_iter=500)

model_sgd.fit(X_train, y_train)
SGDClassifier(max_iter=5)

stop = time.time()
total_time = stop - start
print(total_time)

0.08470630645751953

In [21]:
#taux de classification

y_pred_sgd = model_sgd.predict(X_test)

print(accuracy_score(y_test, y_pred_sgd))

0.796

## Le modèle SVM

In [22]:
# détermination des meilleurs paramètres
from sklearn.model_selection import GridSearchCV
from sklearn import svm

start = time.time()
model_svm = svm.SVC()
model_svm.fit(X_train, y_train)
stop = time.time()
print(f"Temps d'entrainnement pour le SVM : {stop - start}s")

Temps d'entrainnement pour le SVM : 1.9269697666168213s

In [23]:
#taux de classification

y_pred_svm = model_svm.predict(X_test)

print(" le taux de classification : ", accuracy_score(y_test, y_pred_svm))

print(y_pred_svm[0:40])
print(y_test[0:40])

 le taux de classification :  0.86
[0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 0 0]
[0 0 1 1 0 1 0 0 0 0 0 0 0 1 1 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0
 0 0 0]

In [24]:
print(X_train.shape)

(9000, 13)

## Réseau de neuronne

#### Création du modèle:

In [109]:
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense, Dropout

model = models.Sequential()

# construction de réseau de neuronne
model.add(Dense(64,activation='relu'))
model.add(Dense(48,activation='relu'))
model.add(Dense(32,activation='relu'))
model.add(Dense(1,activation='sigmoid'))

model.compile(loss="binary_crossentropy", optimizer="rmsprop", metrics=["accuracy"])

In [110]:
# Apprentissage  
history = model.fit(X_train, y_train, validation_data=(X_test, y_test), epochs=10, batch_size=10)

Epoch 1/10
900/900 [==============================] - 3s 2ms/step - loss: 0.4440 - accuracy: 0.8168 - val_loss: 0.3694 - val_accuracy: 0.8410
Epoch 2/10
900/900 [==============================] - 1s 1ms/step - loss: 0.3701 - accuracy: 0.8466 - val_loss: 0.3382 - val_accuracy: 0.8600
Epoch 3/10
900/900 [==============================] - 1s 1ms/step - loss: 0.3506 - accuracy: 0.8566 - val_loss: 0.3281 - val_accuracy: 0.8680
Epoch 4/10
900/900 [==============================] - 1s 1ms/step - loss: 0.3425 - accuracy: 0.8591 - val_loss: 0.3318 - val_accuracy: 0.8660
Epoch 5/10
900/900 [==============================] - 1s 1ms/step - loss: 0.3268 - accuracy: 0.8653 - val_loss: 0.3390 - val_accuracy: 0.8660
Epoch 6/10
900/900 [==============================] - 1s 1ms/step - loss: 0.3365 - accuracy: 0.8620 - val_loss: 0.3508 - val_accuracy: 0.8630
Epoch 7/10
900/900 [==============================] - 1s 1ms/step - loss: 0.3278 - accuracy: 0.8692 - val_loss: 0.3359 - val_accuracy: 0.8730
Epoch 8/10
900/900 [==============================] - 1s 1ms/step - loss: 0.3270 - accuracy: 0.8705 - val_loss: 0.3361 - val_accuracy: 0.8720
Epoch 9/10
900/900 [==============================] - 1s 2ms/step - loss: 0.3414 - accuracy: 0.8632 - val_loss: 0.3528 - val_accuracy: 0.8640
Epoch 10/10
900/900 [==============================] - 1s 1ms/step - loss: 0.3375 - accuracy: 0.8600 - val_loss: 0.3510 - val_accuracy: 0.8650

In [111]:
predictions = model.predict(X_test)
predictions[:10]

array([[0.0130716 ],
       [0.5924846 ],
       [0.1458444 ],
       [0.22512227],
       [0.00156346],
       [0.05058637],
       [0.07633454],
       [0.16352692],
       [0.00651911],
       [0.10099128]], dtype=float32)

In [112]:
y_pred = model.predict(X_test)
y_pred = np.rint(y_pred)

In [113]:
from sklearn.metrics import confusion_matrix

tn, fp, fn, tp = confusion_matrix(y_test, y_pred, labels=[0,1]).ravel()

print('y_test:' + str(y_test[:10]))
print('y_pred:' + str(y_pred[:10]))
print (tn)
print (fp)
print (fn)
print (tp)
print('sum='+ str(tn + fp + fn + tp))

y_test:[0 0 1 1 0 1 0 0 0 0]
y_pred:[[0.]
 [1.]
 [0.]
 [0.]
 [0.]
 [0.]
 [0.]
 [0.]
 [0.]
 [0.]]
761
34
101
104
sum=1000